{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "units": 12, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 8], "dtype": "float32", "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "name": "dense_2", "units": 8, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "name": "dense_3", "units": 1, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.2.2", "backend": "tensorflow"}