{"class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "input_123", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "int32", "sparse": false, "name": "input_123"}, "inbound_nodes": []}, {"name": "embedding_61", "class_name": "Embedding", "config": {"name": "embedding_61", "trainable": false, "batch_input_shape": [null, 5], "dtype": "float32", "input_dim": 82665, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 5}, "inbound_nodes": [[["input_123", 0, 0, {}]]]}, {"name": "lstm_81", "class_name": "LSTM", "config": {"name": "lstm_81", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.25, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_61", 0, 0, {}]]]}, {"name": "batch_normalization_67", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_67", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_81", 0, 0, {}]]]}, {"name": "lstm_82", "class_name": "LSTM", "config": {"name": "lstm_82", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.25, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"name": "batch_normalization_68", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_68", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_82", 0, 0, {}]]]}, {"name": "dense_56", "class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"name": "batch_normalization_69", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_56", 0, 0, {}]]]}, {"name": "input_124", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "input_124"}, "inbound_nodes": []}, {"name": "input_125", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_125"}, "inbound_nodes": []}, {"name": "concatenate_33", "class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_69", 0, 0, {}], ["input_124", 0, 0, {}], ["input_125", 0, 0, {}]]]}, {"name": "dense_57", "class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "units": 1119, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}], "input_layers": [["input_123", 0, 0], ["input_124", 0, 0], ["input_125", 0, 0]], "output_layers": [["dense_57", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}